{"keras_version": "1.2.2", "config": [{"config": {"activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "trainable": true, "nb_filter": 24, "input_dtype": "float32", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_1", "batch_input_shape": [null, 66, 200, 3], "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "b_regularizer": null, "bias": true, "nb_col": 5, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "subsample": [2, 2], "dim_ordering": "tf", "trainable": true, "nb_filter": 36, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "b_constraint": null, "bias": true, "nb_col": 5, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "subsample": [2, 2], "dim_ordering": "tf", "trainable": true, "nb_filter": 48, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "b_constraint": null, "bias": true, "nb_col": 3, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_3", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "b_constraint": null, "bias": true, "nb_col": 3, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_4", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "b_constraint": null, "bias": true, "nb_col": 3, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_5", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.28, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "linear", "b_regularizer": null, "trainable": true, "name": "dense_1", "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 1164, "input_dim": 7040}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "b_regularizer": null, "trainable": true, "name": "dense_2", "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 100, "input_dim": 1164}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "b_regularizer": null, "trainable": true, "name": "dense_3", "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 50, "input_dim": 100}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "b_regularizer": null, "trainable": true, "name": "dense_4", "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 10, "input_dim": 50}, "class_name": "Dense"}, {"config": {"name": "activation_9", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "b_regularizer": null, "trainable": true, "name": "dense_5", "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 1, "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential"}