{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "nb_row": 5, "name": "convolution2d_1", "nb_filter": 24, "trainable": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "subsample": [2, 2], "batch_input_shape": [null, 66, 200, 3], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [1, 1], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_row": 5, "nb_filter": 36, "trainable": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [1, 1], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_row": 3, "nb_filter": 48, "trainable": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "subsample": [2, 2], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "nb_row": 3, "nb_filter": 64, "trainable": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [1, 1], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_3", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "nb_row": 3, "nb_filter": 64, "trainable": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [1, 1], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_4", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_5", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "input_dim": 8832, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_1", "W_constraint": null, "output_dim": 1164}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_6", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "input_dim": 1164, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_2", "W_constraint": null, "output_dim": 100}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_7", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "input_dim": 100, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_3", "W_constraint": null, "output_dim": 50}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_8", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "input_dim": 50, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_4", "W_constraint": null, "output_dim": 10}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "input_dim": 10, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_5", "W_constraint": null, "output_dim": 1}}], "keras_version": "1.2.2"}