{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "bias": true, "name": "convolution2d_1", "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "subsample": [2, 2], "trainable": true, "border_mode": "same", "W_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "nb_col": 5, "nb_row": 5, "nb_filter": 24, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "name": "batchnormalization_1", "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_2", "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "trainable": true, "border_mode": "same", "W_regularizer": null, "subsample": [2, 2], "nb_col": 5, "nb_row": 5, "nb_filter": 36, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "name": "batchnormalization_2", "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_3", "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "trainable": true, "border_mode": "same", "W_regularizer": null, "subsample": [2, 2], "nb_col": 3, "nb_row": 3, "nb_filter": 48, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "name": "batchnormalization_3", "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_4", "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "trainable": true, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_col": 3, "nb_row": 3, "nb_filter": 64, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "name": "batchnormalization_4", "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_4", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_5", "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "trainable": true, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "nb_col": 3, "nb_row": 3, "nb_filter": 64, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_5", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_1", "b_regularizer": null, "output_dim": 1164, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "input_dim": 7040}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "name": "batchnormalization_5", "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_2", "b_regularizer": null, "output_dim": 100, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "input_dim": 1164}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "name": "batchnormalization_6", "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_3", "b_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "input_dim": 100}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "name": "batchnormalization_7", "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_4", "b_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "input_dim": 50}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_5", "b_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "input_dim": 10}}]}