{"config": [{"config": {"epsilon": 0.001, "gamma_regularizer": null, "input_dtype": "float32", "axis": 1, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "name": "batchnormalization_1", "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "same", "nb_row": 8, "init": "glorot_uniform", "nb_col": 8, "trainable": true, "activation": "linear", "bias": true, "W_regularizer": null, "b_regularizer": null, "subsample": [4, 4], "name": "convolution2d_1", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "nb_filter": 16}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "same", "nb_row": 5, "init": "glorot_uniform", "nb_col": 5, "trainable": true, "activation": "linear", "bias": true, "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "name": "convolution2d_2", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "same", "nb_row": 5, "init": "glorot_uniform", "nb_col": 5, "trainable": true, "activation": "linear", "bias": true, "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "name": "convolution2d_3", "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "bias": true, "W_regularizer": null, "input_dim": 12800, "b_regularizer": null, "name": "dense_1", "W_constraint": null, "activity_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "bias": true, "W_regularizer": null, "input_dim": 512, "b_regularizer": null, "name": "dense_2", "W_constraint": null, "activity_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.2"}